app/views/users/show.html.erb

    <ul>
      <%= render @user.goals.where(complete: false) %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."complete" = $2  [["user_id", 3], ["complete", false]]

    <h3>Completed Goals</h3>
    <% complete_goals = @user.goals.where(complete: true) %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."complete" = $2  [["user_id", 3], ["complete", true]]