app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if params[:goal_id]
      @comment.commentable_id = params[:goal_id]
      @comment.commentable_type = 'Goal'
    else
      @comment.commentable_id = params[:user_id]
      @comment.commentable_type = 'User'
    end
    @comment.author_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("commentable_type", "commentable_id", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commentable_type", "User"], ["commentable_id", 3], ["body", "hi"], ["created_at", "2018-10-20 04:08:57.684467"], ["updated_at", "2018-10-20 04:08:57.684467"], ["author_id", 3]]

  def update
    @comment = Comment.find(params[:id])
    if !@comment
      redirect_to users_url
    end
    url, user_id = commentable_url(@comment)
    if @comment && @comment.author_id == current_user.id && @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "hello there"], ["updated_at", "2018-10-20 16:37:21.111610"], ["id", 1]]

  def destroy
    comment = Comment.find(params[:id])
    if !comment
      redirect_to users_url
    end
    url, user_id = commentable_url(comment)
    if comment.author_id == current_user.id || current_user.id == user_id
      comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]