app/controllers/goals_controller.rb

INSERT INTO "goals" ("user_id", "description", "title", "public", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["description", "sup"], ["title", "A new goal"], ["public", false], ["created_at", "2018-10-20 19:52:49.643621"], ["updated_at", "2018-10-20 19:52:49.643621"]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    @goal.public = public?
    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @goal = Goal.find_by(id: params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "description" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["description", "hello"], ["updated_at", "2018-10-20 16:00:36.842325"], ["id", 4]]
UPDATE "goals" SET "public" = $1 WHERE "goals"."id" = $2  [["public", false], ["id", 1]]
UPDATE "goals" SET "complete" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["complete", false], ["updated_at", "2018-10-20 18:09:43.084481"], ["id", 4]]
---
  def update
    @goal = Goal.find_by(id: params[:id])
    if @goal && @goal.update(goal_params) && ensure_current_user(@goal.user_id)
      @goal.update(public: public?)
      @goal.update(complete: false) if @goal.complete && not_complete?

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]
---
  def destroy
    @goal = Goal.find_by(id: params[:id])
    if @goal && @goal.destroy && ensure_current_user(@goal.user_id)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    if ensure_current_user(params[:user_id])
      @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "goals" SET "complete" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["complete", true], ["updated_at", "2018-10-20 18:08:35.505804"], ["id", 4]]
---
  def complete
    @goal = Goal.find(params[:goal_id])
    if @goal && ensure_current_user(params[:user_id])
      @goal.update(complete: !@goal.complete)