app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "DnD96RrWxU5Zu0CNjg_fJA"], ["updated_at", "2018-10-20 01:14:12.066344"], ["id", 1]]
---
  def create
    @user = User.find_by_credentials(session_params)
    if @user && @user.save