app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user && @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at", "location", "house") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"